app/views/accounting/index.html.erb

SELECT "devices".* FROM "devices"  ORDER BY device_upgrade_cost
---
      </table>
      <%= number_to_currency(a = Device.unpaid.wanted.sum(:device_upgrade_cost),:unit=> "£") %>