app/controllers/accounting_controller.rb

  def edit
    @devices = Device.find(params[:id])
---
SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT 1  [["id", 3]]