app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices"
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = ?  [["user_id", 1]]
---
  def index

    if current_user.admin?
      @devices = Device.all
    else
      @devices = Device.where(user_id: current_user.id)

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "devices".* FROM "devices" WHERE "devices"."user_id" = ? AND "devices"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
  def show
  	if current_user.admin?
      @devices = Device.find(params[:id])
    else
      @devices = Device.where(user_id: current_user.id).find(params[:id])

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    authorize Device
  	@devices = Device.find(params[:id])

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "devices" SET "upgrade_request" = ?, "device_upgrade_cost" = ?, "updated_at" = ? WHERE "devices"."id" = ?  [["upgrade_request", "t"], ["device_upgrade_cost", 0.0], ["updated_at", "2016-05-02 20:29:48.408070"], ["id", 3]]
---
  def update

  	@devices = Device.find(params[:id])
  	if @devices.update(device_params)