app/controllers/searches_controller.rb

SELECT DISTINCT "devices"."device_type" FROM "devices"
SELECT DISTINCT "devices"."device_manufacturer" FROM "devices"
SELECT DISTINCT "users"."id" FROM "users"
---
	def new
		@search = Search.new
		@search2 = Search.new
		@device_type = Device.uniq.pluck(:device_type)
		@device_type2 = Device.uniq.pluck(:device_type)
    @device_manufacturer = Device.uniq.pluck(:device_manufacturer)
		@device_manufacturer2 = Device.uniq.pluck(:device_manufacturer)
		@user_id = User.uniq.pluck(:id)

INSERT INTO "searches" ("user_first_name", "user_last_name", "office_location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_first_name", "b"], ["user_last_name", ""], ["office_location", ""], ["created_at", "2016-05-02 19:33:59.628616"], ["updated_at", "2016-05-02 19:33:59.628616"]]
---
	def create
		@search = Search.create(search_params)